hagianga21/Smarthome/Soft/STM32F4/Master_ver4/Src/main.c
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"
#include "cmsis_os.h"
#include "fatfs.h"
#include "lcd_txt.h"
#include "lcdDisplay.h"
#include <string.h>
#define DS3231_ADD 0x68

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;
DMA_HandleTypeDef hdma_i2c1_rx;

SD_HandleTypeDef hsd;

UART_HandleTypeDef huart4;
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;

osThreadId TaskAnswerSysHandle;
osThreadId TaskGSMHandle;
osThreadId TaskESPHandle;
osThreadId TaskDS3231_AskHandle;
osThreadId TaskLCDHandle;

//My code-----------------------------------------------------------------------------//
uint8_t send_data =0x41, receive_data2=0;
uint8_t devicesState[16] = "0000000000000000";
//SET Time
uint8_t setHourOn[11], setMinOn[11], setHourOff[11], setMinOff[11];
//DS3231
uint8_t BCD2DEC(uint8_t data);
uint8_t DEC2BCD(uint8_t data);
uint8_t receiveDataFromDS3231[7], sendDataToDS3231[7];
uint8_t second,minute,hour,day,date,month,year;
uint8_t oldsecond,oldminute,oldhour,oldday,olddate,oldmonth,oldyear;
uint8_t receiveDataFromEEPROM[2], sendDataToEEPROM[2];
//UART1 System
uint8_t numberOfButton = 1, numberOfDevice = 1;
uint8_t count1 = 0, tempdataReceiveFromSystem, flagReceiveAllDataFromSystem = 0;
uint8_t dataReceiveFromSystem[11], dataSendtoSystem[11];
uint8_t countSensor = 1 ,temperature = 0, humid = 0, gasDetection = 0, humanDetection = 0;
//UART2 Internet
uint8_t count2 = 0, flagReceiveAllDataFromInternet = 0, tempdataReceiveFromInternet;
uint8_t dataReceiveFromInternet[18], devicesStateUpdateToInternet[18] = "S0000000000000000E";
uint8_t dataFromSensorToInternet[11] = "S03C01000TE";
//UART3 Module sim 800A
uint8_t dataReceiveFromSim800[100], tempdataReceiveFromSim800;
uint8_t count3 = 0, flagReceiveAllDataFromSim800 = 0, flagSms = 0;
uint8_t smsDetail[100], countDetail = 0;
//LCD
float var = 0.123;
char buffer[20];
uint8_t lcd_mode = 0, old_lcd_mode = 0;
//-------------------------------------------------------------------------------------//

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_UART4_Init(void);
static void MX_I2C1_Init(void);
static void MX_SDIO_SD_Init(void);
void StartDefaultTask(void const * argument);
void StartTask02(void const * argument);
void StartTask03(void const * argument);
void StartTask04(void const * argument);
void StartTask05(void const * argument);

//My code-----------------------------------------------------------------------------//
void sendRS485toSystem(void);
void setIDforButton(void);
void setIDforDevice(void);
void writeDataToDS3132(void);
void controlDevice(void);
void updateStateToInternet(void);
void updateDevicesState(void);
void sendDataFromSensorToInternet(void);
void answerSystem(void);
void processDataFromInternet(void);
void checkSetTime(void);
void checkTimeToReadSensor(void);
void Initsim900A(void);
void Call(void);
void sendMessage(char *s,int length);
void deleteSMS(void);
void processDataFromSim(void);
void processDetailSms (void);
void checkLCD(void);
uint8_t convertNumToStringMSB(uint8_t number);
uint8_t convertNumToStringLSB(uint8_t number);
uint8_t convertStringToNum(uint8_t MSB, uint8_t LSB);
//-------------------------------------------------------------------------------------//

int main(void)
{
  HAL_Init();
  SystemClock_Config();
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART1_UART_Init();
  MX_USART2_UART_Init();
  MX_USART3_UART_Init();
  MX_UART4_Init();
  MX_I2C1_Init();
  MX_SDIO_SD_Init();
	/* init code for FATFS (Truoc day no de o Defaut Task)*/
  MX_FATFS_Init();
	
	//My code-----------------------------------------------------------------------------//
	HAL_UART_Receive_IT(&huart1,&tempdataReceiveFromSystem,1);
	HAL_UART_Receive_IT(&huart2,&tempdataReceiveFromInternet,1);
	HAL_UART_Receive_IT(&huart3,&tempdataReceiveFromSim800,1);
	HAL_UART_Receive_IT(&huart4,&receive_data2,1);
	HAL_Delay(300);
	Initsim900A();
	deleteSMS();
	//Call();
	sendMessage("Giang dep trai",14);
	//Init LCD
	lcd_init();
	lcd_Intro();
	HAL_Delay(1000);
	lcd_clear();
	lcd_HomePage(day,date,month,year,hour,minute,second);
	HAL_Delay(500);
	//sprintf(buffer,"%0.4f",var);
	//lcd_puts(1,0,(int8_t*)buffer);
	//-------------------------------------------------------------------------------------//

  /* Create the thread(s) */
  /* definition and creation of TaskAnswerSys */
  osThreadDef(TaskAnswerSys, StartDefaultTask, osPriorityNormal, 0, 128);
  TaskAnswerSysHandle = osThreadCreate(osThread(TaskAnswerSys), NULL);

  /* definition and creation of TaskGSM */
  osThreadDef(TaskGSM, StartTask02, osPriorityNormal, 0, 128);
  TaskGSMHandle = osThreadCreate(osThread(TaskGSM), NULL);

  /* definition and creation of TaskESP */
  osThreadDef(TaskESP, StartTask03, osPriorityNormal, 0, 128);
  TaskESPHandle = osThreadCreate(osThread(TaskESP), NULL);

  /* definition and creation of TaskDS3231_Ask */
  osThreadDef(TaskDS3231_Ask, StartTask04, osPriorityNormal, 0, 128);
  TaskDS3231_AskHandle = osThreadCreate(osThread(TaskDS3231_Ask), NULL);

  /* definition and creation of TaskLCD */
  osThreadDef(TaskLCD, StartTask05, osPriorityNormal, 0, 128);
  TaskLCDHandle = osThreadCreate(osThread(TaskLCD), NULL);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */
 

  /* Start scheduler */
  osKernelStart();
  
  /* We should never get here as control is now taken by the scheduler */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {}
}


//My code-----------------------------------------------------------------------------//
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin){
	//ENTER
	if(GPIO_Pin == GPIO_PIN_0){
		if(lcd_mode == 0){
			lcd_mode = 1;
		}
	}
	//BACK
	if(GPIO_Pin == GPIO_PIN_1){
		if(lcd_mode>0){
			lcd_mode = 0;
		}
	}
	//UP
	if(GPIO_Pin == GPIO_PIN_2){
		if(lcd_mode>0){
			lcd_mode--;
			if(lcd_mode == 0){
				lcd_mode=3;
			}
		}
	}
	//DOWN
	if(GPIO_Pin == GPIO_PIN_3){
		if(lcd_mode>0){
			lcd_mode++;
			if(lcd_mode>3){
				lcd_mode=1;
			}
		}	
	}
	//
}

