hagianga21/Smarthome/Soft/STM32F4/Master_ver4/Src/main.c
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	if(huart->Instance==huart1.Instance){
		HAL_UART_Receive_IT(&huart1,&tempdataReceiveFromSystem,1);
		if(tempdataReceiveFromSystem == 'S'){
			count1 = 0;
			dataReceiveFromSystem[count1] = tempdataReceiveFromSystem;
			count1++;
		}
		if(tempdataReceiveFromSystem != 'S' && tempdataReceiveFromSystem != 'E'){
			dataReceiveFromSystem[count1] = tempdataReceiveFromSystem;
			count1++;
		}	
		if(tempdataReceiveFromSystem == 'E'){
			dataReceiveFromSystem[count1] = tempdataReceiveFromSystem;
			count1 = 0;
			flagReceiveAllDataFromSystem = 1;
			HAL_UART_Transmit_IT(&huart4,dataReceiveFromSystem,11);
		}
	}
	
	if(huart->Instance==huart2.Instance){
		HAL_UART_Receive_IT(&huart2,&tempdataReceiveFromInternet,1);
		if(tempdataReceiveFromInternet == 'S'){
			count2 = 0;
			dataReceiveFromInternet[count2] = tempdataReceiveFromInternet;
			count2++;
		}
		if(tempdataReceiveFromInternet != 'S' && tempdataReceiveFromInternet != 'E' && tempdataReceiveFromInternet != 0x0A && tempdataReceiveFromInternet != 0x0D){
			dataReceiveFromInternet[count2] = tempdataReceiveFromInternet;
			count2++;
		}	
		if(tempdataReceiveFromInternet == 'E'){
			dataReceiveFromInternet[count2] = tempdataReceiveFromInternet;
			count2 = 0;
			flagReceiveAllDataFromInternet = 1;
		}
	}
	if(huart->Instance==huart3.Instance){
		HAL_UART_Receive_IT(&huart3,&tempdataReceiveFromSim800,1);
		if(tempdataReceiveFromSim800 != 0x0A && tempdataReceiveFromSim800 != 0x0D){
			if(flagSms == 1 && countDetail == 2){
				smsDetail[count3] = tempdataReceiveFromSim800;
			}
			else{
				dataReceiveFromSim800[count3] = tempdataReceiveFromSim800;
			}
			count3++;
		}
		else if(tempdataReceiveFromSim800 == 0x0D){
			HAL_UART_Transmit_IT(&huart4,dataReceiveFromSim800,count3);
			flagReceiveAllDataFromSim800 = 1;
			count3 = 0;
			if(flagSms == 1){
				countDetail++;
			}
		}
		else{
			count3 = 0;
		}
	}
	if(huart->Instance==huart4.Instance){
		HAL_UART_Receive_IT(&huart4,&receive_data2,1);
		HAL_UART_Transmit_IT(&huart4,&receive_data2,1);
	}
}

void HAL_I2C_MemRxCpltCallback(I2C_HandleTypeDef *hi2c){
	if(hi2c->Instance==hi2c1.Instance){
		second = BCD2DEC(receiveDataFromDS3231[0]);
		minute = BCD2DEC(receiveDataFromDS3231[1]);
		hour = BCD2DEC(receiveDataFromDS3231[2]);
		
		day = BCD2DEC(receiveDataFromDS3231[3]);
		date = BCD2DEC(receiveDataFromDS3231[4]);
		month = BCD2DEC(receiveDataFromDS3231[5]);
		year = BCD2DEC(receiveDataFromDS3231[6]);
	}
}

//-------------------------------------------------------------------------------------//
//My code-----------------------------------------------------------------------------//

uint8_t BCD2DEC(uint8_t data){
	return (data>>4)*10 + (data&0x0f);
}

uint8_t DEC2BCD(uint8_t data){
	return (data/10)<<4|(data%10);
}

uint8_t convertNumToStringMSB(uint8_t number){
	return (number/10)+48;
}

uint8_t convertNumToStringLSB(uint8_t number){
	return (number%10)+48;
}

uint8_t convertStringToNum(uint8_t MSB, uint8_t LSB){
	MSB = MSB - 48;
	LSB = LSB - 48;
	return (MSB*10+LSB);
}


void writeDataToDS3132(void){
	sendDataToDS3231[0] = DEC2BCD(0);
	sendDataToDS3231[1] = DEC2BCD(46);
	sendDataToDS3231[2] = DEC2BCD(10);
	
	sendDataToDS3231[3] = DEC2BCD(5);
	sendDataToDS3231[4] = DEC2BCD(21);
	sendDataToDS3231[5] = DEC2BCD(9);
	sendDataToDS3231[6] = DEC2BCD(17);
	HAL_I2C_Mem_Write_IT(&hi2c1,DS3231_ADD<<1,0,I2C_MEMADD_SIZE_8BIT,sendDataToDS3231,7);
}

void sendRS485toSystem(void){
	HAL_GPIO_WritePin(GPIOD,GPIO_PIN_12,GPIO_PIN_SET);
	HAL_GPIO_WritePin(GPIOB,GPIO_PIN_5,GPIO_PIN_SET);
	HAL_UART_Transmit_IT(&huart1,dataSendtoSystem,11);
	HAL_UART_Transmit_IT(&huart4,dataSendtoSystem,11);
	HAL_Delay(150);
	HAL_GPIO_WritePin(GPIOB,GPIO_PIN_5,GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOD,GPIO_PIN_12,GPIO_PIN_RESET);
}
void setIDforButton(void){
	static uint8_t i = 0;
	for(i = 0; i<(dataReceiveFromSystem[9]-48);i++){
		dataSendtoSystem[0]  = 'S';
		dataSendtoSystem[1]  = '1';
		dataSendtoSystem[2]  = '2';
		dataSendtoSystem[3]  = 'B';
		dataSendtoSystem[4]  = convertNumToStringMSB(numberOfButton);
		dataSendtoSystem[5]  = convertNumToStringLSB(numberOfButton);
		dataSendtoSystem[6]  = 'D';
		dataSendtoSystem[7]  = convertNumToStringMSB(numberOfButton);
		dataSendtoSystem[8]  = convertNumToStringLSB(numberOfButton);
		dataSendtoSystem[9]  = convertNumToStringLSB(i+1);
		dataSendtoSystem[10] = 'E';
		numberOfButton++;
		sendRS485toSystem();
		HAL_Delay(400);
	}
}

void setIDforDevice(void){
	static uint8_t i = 0;
	for(i = 0; i<(dataReceiveFromSystem[9]-48);i++){
		dataSendtoSystem[0]  = 'S';
		dataSendtoSystem[1]  = '1';
		dataSendtoSystem[2]  = '2';
		dataSendtoSystem[3]  = 'B';
		dataSendtoSystem[4]  = convertNumToStringMSB(numberOfDevice);
		dataSendtoSystem[5]  = convertNumToStringLSB(numberOfDevice);
		dataSendtoSystem[6]  = '0';
		dataSendtoSystem[7]  = '0';
		dataSendtoSystem[8]  = '0';
		dataSendtoSystem[9]  = convertNumToStringLSB(i+1);
		dataSendtoSystem[10] = 'E';
		numberOfDevice++;
		sendRS485toSystem();
	}
}

void controlDevice(void){
		dataSendtoSystem[0]  = 'S';
		dataSendtoSystem[1]  = '1';
		dataSendtoSystem[2]  = '0';
		dataSendtoSystem[3]  = 'D';
		dataSendtoSystem[4]  = dataReceiveFromSystem[7];
		dataSendtoSystem[5]  = dataReceiveFromSystem[8];
		dataSendtoSystem[6]  = '0';
		dataSendtoSystem[7]  = '0';
		dataSendtoSystem[8]  = '0';
		dataSendtoSystem[9]  = dataReceiveFromSystem[9];
		dataSendtoSystem[10] = 'E';
		sendRS485toSystem();
}

void updateDevicesState(void){
	uint8_t i;
	i = convertStringToNum(dataSendtoSystem[4],dataSendtoSystem[5]);
	devicesState[i] = dataSendtoSystem[9];
}

void updateStateToInternet(void){
	uint8_t i;
	for(i=1;i<16;i++){
			devicesStateUpdateToInternet[i+1] = devicesState[i];
	}
	HAL_UART_Transmit_IT(&huart2,devicesStateUpdateToInternet,18);
	HAL_Delay(100);
}

void sendDataFromSensorToInternet(void){
	HAL_UART_Transmit_IT(&huart2,dataFromSensorToInternet,11);
	HAL_Delay(100);
}
void answerSystem(void){
	//control device
	if(dataReceiveFromSystem[2] == '0'){
		controlDevice();
		updateDevicesState();
		updateStateToInternet();
	}
	//set ma device
	if(dataReceiveFromSystem[2] == '2'){
		if(dataReceiveFromSystem[8] == 'B'){
			setIDforButton();
		}
		if(dataReceiveFromSystem[8] == 'D'){
			setIDforDevice();
		}
	}
	//receive data from sensor
	if(dataReceiveFromSystem[2] == '3'){
		if(dataReceiveFromSystem[9] == 'T'){
			dataFromSensorToInternet[9]= 'T';
			dataFromSensorToInternet[7] = dataReceiveFromSystem[7];
			dataFromSensorToInternet[8] = dataReceiveFromSystem[8];
			sendDataFromSensorToInternet();
			temperature = convertStringToNum(dataReceiveFromSystem[7],dataReceiveFromSystem[8]);
		}
		if(dataReceiveFromSystem[9] == 'H'){
			dataFromSensorToInternet[9]= 'H';
			dataFromSensorToInternet[7] = dataReceiveFromSystem[7];
			dataFromSensorToInternet[8] = dataReceiveFromSystem[8];
			sendDataFromSensorToInternet();
			humid = convertStringToNum(dataReceiveFromSystem[7],dataReceiveFromSystem[8]);
		}
		if(dataReceiveFromSystem[9] == 'G'){
			dataFromSensorToInternet[9]= 'G';
			dataFromSensorToInternet[7] = dataReceiveFromSystem[7];
			dataFromSensorToInternet[8] = dataReceiveFromSystem[8];
			sendDataFromSensorToInternet();
			gasDetection = convertStringToNum(dataReceiveFromSystem[7],dataReceiveFromSystem[8]);
		}
		if(dataReceiveFromSystem[9] == 'M'){
			dataFromSensorToInternet[9]= 'M';
			dataFromSensorToInternet[7] = dataReceiveFromSystem[7];
			dataFromSensorToInternet[8] = dataReceiveFromSystem[8];
			sendDataFromSensorToInternet();
			humanDetection = convertStringToNum(dataReceiveFromSystem[7],dataReceiveFromSystem[8]);
		}
	}
	
