hagianga21/Smarthome/Soft/STM32F4/Master_ver4/Src/main.c
}

void processDataFromInternet(void){
	uint8_t i,tempHour,tempMin;
	if(dataReceiveFromInternet[1] == '0'){
		 for(i=1;i<16;i++){
				if(devicesState[i] != dataReceiveFromInternet[i+1]){
					devicesState[i] = dataReceiveFromInternet[i+1];
					dataSendtoSystem[0]  = 'S';
					dataSendtoSystem[1]  = '1';
					dataSendtoSystem[2]  = '0';
					dataSendtoSystem[3]  = 'D';
					dataSendtoSystem[4]  = convertNumToStringMSB(i);
					dataSendtoSystem[5]  = convertNumToStringLSB(i);
					dataSendtoSystem[6]  = '0';
					dataSendtoSystem[7]  = '0';
					dataSendtoSystem[8]  = '0';
					dataSendtoSystem[9]  = devicesState[i];
					dataSendtoSystem[10] = 'E';
					HAL_Delay(200);
					//Gui ve cho UART 1
					sendRS485toSystem();
					updateDevicesState();
					HAL_Delay(100);
					//HAL_UART_Transmit_IT(&huart2,dataSendtoSystem,11);
					HAL_Delay(100);
				}
		 }
	}
	if(dataReceiveFromInternet[1] == '1'){
			i = convertStringToNum(dataReceiveFromInternet[3],dataReceiveFromInternet[4]);
			tempHour = convertStringToNum(dataReceiveFromInternet[5],dataReceiveFromInternet[6]);
			tempMin = convertStringToNum(dataReceiveFromInternet[7],dataReceiveFromInternet[8]);
			if(dataReceiveFromInternet[9] == '1'){
					setHourOn[i] = tempHour;
					setMinOn[i] = tempMin;
			}
			if(dataReceiveFromInternet[9] == '0'){
					setHourOff[i] = tempHour;
					setMinOff[i] = tempMin;
			}
	}
}

void checkSetTime(void){
	uint8_t i;
	for(i=1;i<11;i++){
		if(setHourOn[i] > 0 || setMinOn[i] > 0){
				if(setHourOn[i] == hour && setMinOn[i] == minute){
						setHourOn[i] = 0;
						setMinOn[i] = 0;
						dataSendtoSystem[0]  = 'S';
						dataSendtoSystem[1]  = '1';
						dataSendtoSystem[2]  = '0';
						dataSendtoSystem[3]  = 'D';
						dataSendtoSystem[4]  = convertNumToStringMSB(i);
						dataSendtoSystem[5]  = convertNumToStringLSB(i);
						dataSendtoSystem[6]  = '0';
						dataSendtoSystem[7]  = '0';
						dataSendtoSystem[8]  = '0';
						dataSendtoSystem[9]  = '1';
						dataSendtoSystem[10] = 'E';
						sendRS485toSystem();
						HAL_GPIO_WritePin(GPIOD,GPIO_PIN_13,GPIO_PIN_SET);
						updateDevicesState();
						updateStateToInternet();
				}
		}
		if(setHourOff[i] > 0 || setMinOff[i] > 0){
				if(setHourOff[i] == hour && setMinOff[i] == minute && second < 4){
						setHourOff[i] = 0;
						setMinOff[i] = 0;
						dataSendtoSystem[0]  = 'S';
						dataSendtoSystem[1]  = '1';
						dataSendtoSystem[2]  = '0';
						dataSendtoSystem[3]  = 'D';
						dataSendtoSystem[4]  = convertNumToStringMSB(i);
						dataSendtoSystem[5]  = convertNumToStringLSB(i);
						dataSendtoSystem[6]  = '0';
						dataSendtoSystem[7]  = '0';
						dataSendtoSystem[8]  = '0';
						dataSendtoSystem[9]  = '0';
						dataSendtoSystem[10] = 'E';
						sendRS485toSystem();
						HAL_GPIO_WritePin(GPIOD,GPIO_PIN_13,GPIO_PIN_RESET);
						updateDevicesState();
						updateStateToInternet();
				}
		}
	}
}

void checkTimeToReadSensor(void){
	if(minute != oldminute){
		oldminute = minute;
		strcpy((char *)dataSendtoSystem,"S13C01000TE");
		sendRS485toSystem();
		HAL_Delay(600);
		
		if(flagReceiveAllDataFromSystem == 1){
			flagReceiveAllDataFromSystem = 0;
			answerSystem();
		}
		strcpy((char *)dataSendtoSystem,"S13C01000HE");
		sendRS485toSystem();
		HAL_Delay(100);
		
	}
}

void Initsim900A(void){
	HAL_UART_Transmit_IT(&huart3,(uint8_t *)"AT\r\n",4);	//Tat che do phan hoi
	HAL_Delay(300);
	HAL_UART_Transmit_IT(&huart3,(uint8_t *)"ATE0\r\n",6);	//Tat che do phan hoi
	HAL_Delay(300);
	HAL_UART_Transmit_IT(&huart3,(uint8_t *)"AT+CMGF=1\r\n",11); //Dua tin nhan ve che do text
	HAL_Delay(300);
	HAL_UART_Transmit_IT(&huart3,(uint8_t *)"AT+CLIP=1\r\n",11); //Hien thi thong tin cuoc goi toi
	HAL_Delay(300);
	HAL_UART_Transmit_IT(&huart3,(uint8_t *)"AT+CNMI=2,1,0,0,0\r\n",19); // bao hieu khi co 1 tin nhan gui toi: +CMTI: "SM",1
	HAL_Delay(300);
}

void Call(void){
	HAL_UART_Transmit_IT(&huart3,(uint8_t *)"ATD0939863350;\r\n",16); //0935185037 0939863350 
	HAL_Delay(15000);
	HAL_UART_Transmit_IT(&huart3,(uint8_t *)"ATH\r\n",5);
	HAL_Delay(2000);
}
void sendMessage(char *s,int length){
	uint8_t send = 0x1A;
	HAL_UART_Transmit_IT(&huart3,(uint8_t *)"AT+CMGS=\"0939863350\"\r\n",22);
	HAL_Delay(3000);
	HAL_UART_Transmit_IT(&huart3,(uint8_t *)s,length);
	HAL_Delay(3000);
	HAL_UART_Transmit_IT(&huart3,&send,1);
	HAL_Delay(3000);
}
void deleteSMS(void){
	HAL_UART_Transmit_IT(&huart3,(uint8_t *)"AT+CMGDA=\"DEL ALL\"\r\n",22);
	HAL_Delay(3000);
}

void processDetailSms (void){
	if(strcmp((const char *)smsDetail,"Turn on device 1") == 0){
		devicesState[1]='1';
		strcpy((char *)dataSendtoSystem,"S10D010001E");
		sendRS485toSystem();
		updateStateToInternet();
		sendMessage("System turned on device 1",25);
	}
	if(strcmp((const char *)smsDetail,"Turn off device 1") == 0){
		devicesState[1]='0';
		strcpy((char *)dataSendtoSystem,"S10D010000E");
		sendRS485toSystem();
		updateStateToInternet();
		sendMessage("System turned off device 1",26);
	}
}
	
void processDataFromSim(void){
	int i;
	if(strstr((char *)dataReceiveFromSim800,"+CMTI:") != NULL){
		flagSms = 1;
		for(i=0;i<100;i++){
			smsDetail[i]=0;
		}
		
	}
	if(flagSms == 1){
		HAL_UART_Transmit_IT(&huart3,(uint8_t *)"AT+CMGR=1\r\n",11);
		HAL_Delay(2000);
		flagSms = 0;
		countDetail = 0;
		for(i=0;i<100;i++){
			dataReceiveFromSim800[i] = 0;
		}
		deleteSMS();
		processDetailSms();
	}
	
}

void checkLCD(void){
	if(lcd_mode != old_lcd_mode){
		lcd_clear();
		old_lcd_mode = lcd_mode;
	}
	if(lcd_mode == 0){
		lcd_HomePage(day,date,month,year,hour,minute,second);
	}
	if(lcd_mode == 1){
		lcd_Mode_1_page();
	}
	if(lcd_mode == 2){
		lcd_Mode_2_page();
	}
	if(lcd_mode == 3){
		lcd_Mode_3_page();
	}
}
//-------------------------------------------------------------------------------------//
/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Configure the main internal regulator output voltage 
    */
  __HAL_RCC_PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

