hagianga21/Smarthome/Soft/STM32F4/Master_ver4/Src/main.c
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/*Task Answer System*/
void StartDefaultTask(void const * argument)
{
  for(;;){
		
    if(flagReceiveAllDataFromSystem == 1){
			flagReceiveAllDataFromSystem = 0;
			HAL_Delay(200);
			answerSystem();
		}
  }
}

/* GSM */
void StartTask02(void const * argument)
{
  for(;;){
		
    if(flagReceiveAllDataFromSim800 == 1){
			processDataFromSim();
			flagReceiveAllDataFromSim800 = 0;
		}
  }
}

/* ESP */
void StartTask03(void const * argument)
{
  for(;;){
    if(flagReceiveAllDataFromInternet == 1){
			flagReceiveAllDataFromInternet = 0;
			processDataFromInternet();
		}
  }
}

/* DS3231 and ASK */
void StartTask04(void const * argument)
{
  for(;;){
    HAL_I2C_Mem_Read_DMA(&hi2c1,DS3231_ADD<<1,0,I2C_MEMADD_SIZE_8BIT,receiveDataFromDS3231,7);
		checkTimeToReadSensor();
		checkSetTime();
  }
}

/* TASK LCD */
void StartTask05(void const * argument)
{
  for(;;){
    checkLCD();
  }
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM4 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
/* USER CODE BEGIN Callback 0 */

/* USER CODE END Callback 0 */
  if (htim->Instance == TIM4) {
    HAL_IncTick();
  }
/* USER CODE BEGIN Callback 1 */

/* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
